<a href="https://colab.research.google.com/github/hasanasyarie/Pusat-Studi-Data-Sains/blob/main/Pandas_DataFrame_Bagian_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Assalamualaikum warahmatullahi wabarakatuh.

Robbi Zidni Ilma Warzuqni Fahma

Semoga Allah memberi kemudahan untuk kita memperoleh ilmu yang bermanfaat.

Ini adalah notebook yang disusun untuk program **Pejuang Data Sains 1.0**

---

Ini adalah Modul: **Pandas DataFrame Bagian-3
(Modification DataFrame)**


---

**Sebelum memulai mempelajari notebook ini, jangan lupa untuk menyalinnya di drive masing-masing ya.**

**!!!**

#Modification DataFrame

##Merubah Nama Kolom

In [ ]:
# Membuat DataFrame

import pandas as pd
data = {'satu' : [1,1,1,1],'dua' : [2,2,2,2],'tiga' : [3,3,3,3]}

df = pd.DataFrame(data, columns=['satu','dua','tiga'])
df = pd.DataFrame(data,index=['a','b','c','d'])

df

   satu  dua  tiga
a     1    2     3
b     1    2     3
c     1    2     3
d     1    2     3

In [ ]:
#Silahkan coba sendiri
#Membuat Data Frame

import pandas as pd
data = {'satu' : [1,1,1,1], 'dua' : [2,2,2,2], 'tiga' : [3,3,3,3]}

df = pd.DataFrame(data, columns = ['satu','dua','tiga'])
df = pd.DataFrame(data, index = ['a','b','c','d'])

df

   satu  dua  tiga
a     1    2     3
b     1    2     3
c     1    2     3
d     1    2     3

In [ ]:
# Merubah Nama Kolom
df.columns =['pertama','kedua','ketiga']
df

   pertama  kedua  ketiga
a        1      2       3
b        1      2       3
c        1      2       3
d        1      2       3

In [ ]:
#Saatnya kamu mencoba disini
#Mengubah nama kolom

df.columns = ['pertama','kedua','ketiga']
df

   pertama  kedua  ketiga
a        1      2       3
b        1      2       3
c        1      2       3
d        1      2       3

##Menambah Kolom baru berdasarkan data yang ada

In [ ]:
#Membuat DataFrame
import pandas as pd
data = {'satu' : [1,1,1,1],'dua' : [2,2,2,2],'tiga' : [3,3,3,3]}

df = pd.DataFrame(data, columns=['satu','dua','tiga'])
df = pd.DataFrame(data,index=['a','b','c','d'])

df

   satu  dua  tiga
a     1    2     3
b     1    2     3
c     1    2     3
d     1    2     3

In [ ]:
#Menambah Kolom baru berdasarkan data yang ada, misal kolom D=Kolom C^2
df['keempat']=df['ketiga']**2
df

##Menambah Kolom baru dengan list data baru

In [ ]:
#Menambah Kolom baru dengan list data baru

df['kelima']=pd.DataFrame([5,5,5,5],index=['a','b','c','d'])
df

   satu  dua  tiga  kelima
a     1    2     3       5
b     1    2     3       5
c     1    2     3       5
d     1    2     3       5

In [ ]:
#Saatnya kamu mencoba disini

##Menghapus baris yang berisi 0, NaN, empty

In [ ]:
#Membuat DataFrame
import pandas as pd


data = {'satu' : [1,np.nan,1,1],'dua' : [2,2,np.nan,2],'tiga' : [3,3,3,3]}

df = pd.DataFrame(data, columns=['satu','dua','tiga'])
df = pd.DataFrame(data, index=['a','b','c','d'])

df

In [ ]:
#Menghapus baris yang berisi NaN
df.dropna(axis=1) #bisa ditulis juga df.dropna(axis=0). akan menghapus semua baris yang memiliki NaN. atau df.dropna(axis=1), menghapus semua kolom yang memiliki NaN

   satu  dua  tiga  kelima
a     1    2     3       5
b     1    2     3       5
c     1    2     3       5
d     1    2     3       5

In [ ]:
#Saatnya kamu mencoba disini

##Membuat dataframe baru dengan memilih kolom tertentu(column Slicing)

In [ ]:
import pandas as pd
data = {'satu' : [1,1,1,1],'dua' : [2,2,2,2],'tiga' : [3,3,3,3]}

df = pd.DataFrame(data, columns=['satu','dua','tiga'])
df = pd.DataFrame(data, index=['a','b','c','d'])

df

   satu  dua  tiga
a     1    2     3
b     1    2     3
c     1    2     3
d     1    2     3

In [ ]:
df['tiga']

a    3
b    3
c    3
d    3
Name: tiga, dtype: int64

In [ ]:
#Saatnya kamu mencoba disini
df

   satu  dua  tiga
a     1    2     3
b     1    2     3
c     1    2     3
d     1    2     3

##Membuat dataframe baru dengan memilih baris tertentu(row Slicing)

In [ ]:
#Membuat DataFrame
import pandas as pd
data = {'satu' : [1,1,1,1],'dua' : [2,2,2,2],'tiga' : [3,3,3,3]}

df = pd.DataFrame(data, columns=['satu','dua','tiga'])
df = pd.DataFrame(data, index=['a','b','c','d'])

df

   satu  dua  tiga
a     1    2     3
b     1    2     3
c     1    2     3
d     1    2     3

In [ ]:
#Membuat dataframe baru dengan memilih baris tertentu(row Slicing)
df[2:3]

   satu  dua  tiga
c     1    2     3

In [ ]:
#Saatnya kamu mencoba disini
df

   satu  dua  tiga
a     1    2     3
b     1    2     3
c     1    2     3
d     1    2     3

##Membuat dataframe baru dengan slicing dengan iloc

In [ ]:
#iloc function
data = {'Nama' : ['Budi','Adi','Putri','Diah'],'Umur' : [17,25,24,30],'Gender' : ['L','L','P','P'], 'Pekerjaan':['Pelajar','Dokter','PNS','Ibu Rumah Tangga']}

df = pd.DataFrame(data, columns=['Nama','Umur','Gender','Pekerjaan'])
df = pd.DataFrame(data, index=['a','b','c','d'])

df

    Nama  Umur Gender         Pekerjaan
a   Budi    17      L           Pelajar
b    Adi    25      L            Dokter
c  Putri    24      P               PNS
d   Diah    30      P  Ibu Rumah Tangga

In [ ]:
df

    Nama  Umur Gender         Pekerjaan
a   Budi    17      L           Pelajar
b    Adi    25      L            Dokter
c  Putri    24      P               PNS
d   Diah    30      P  Ibu Rumah Tangga

In [ ]:
df.iloc[:]

    Nama  Umur Gender         Pekerjaan
a   Budi    17      L           Pelajar
b    Adi    25      L            Dokter
c  Putri    24      P               PNS
d   Diah    30      P  Ibu Rumah Tangga

In [ ]:
df.iloc[1,3]

'Dokter'

In [ ]:
df.iloc[1:3,1:-1]

   Umur Gender
b    25      L
c    24      P

In [ ]:
df.iloc[1:3,1:-1].values

array([[25, 'L'],
       [24, 'P']], dtype=object)